brainfuck/app/controllers/programs_controller.rb

SELECT "programs".* FROM "programs"
---
  def index
    @programs = Program.all

SELECT  "programs".* FROM "programs"  WHERE "programs"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_program
      @program = Program.find(params[:id])